Revit 2024 API
EnergyAnalysisDetailModel.IncludeShadingSurfaces Property
 Indicates if to set and get the setting for if shading surfaces should be included.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IncludeShadingSurfaces { get; }
Visual Basic
Public ReadOnly Property IncludeShadingSurfaces As Boolean
	Get
Visual C++
public:
property bool IncludeShadingSurfaces {
	bool get ();
}
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace